InformationRegisters/ОчередьОбработкиВходящихДокументовМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОбработкиВходящихДокументовМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСубъектаОбращения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОрганизацииОтправителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квитанция</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьОбработкиВходящихДокументовМДЛП/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Запись.ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
		Запись.ДатаРегистрации = ТекущаяДатаСеанса();
		Если Не Параметры.ЗначениеКопирования.Пустой() Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ Данные, Квитанция ИЗ РегистрСведений.ОчередьОбработкиВходящихДокументовМДЛП ГДЕ ИдентификаторСообщения = &Идентификатор");
			Запрос.УстановитьПараметр("Идентификатор", Параметры.ЗначениеКопирования.ИдентификаторСообщения);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				УстановитьТекстСообщения(ТекстСообщения, Выборка.Данные.Получить());
				УстановитьТекстСообщения(ТекстКвитанции, Выборка.Квитанция.Получить());
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьТекстСообщения(ТекстСообщения, ТекущийОбъект.Данные.Получить());
	УстановитьТекстСообщения(ТекстКвитанции, ТекущийОбъект.Квитанция.Получить());
	
	Если ПустаяСтрока(ТекстКвитанции.ПолучитьТекст()) Тогда
		Элементы.ТекстКвитанции.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Сообщение = ИнтеграцияМДЛП.ФорматироватьТекстСообщения(ТекстСообщения.ПолучитьТекст(), Ложь);
	ТекущийОбъект.Данные = Новый ХранилищеЗначения(Сообщение, Новый СжатиеДанных(9));
	
	Квитанция = ТекстКвитанции.ПолучитьТекст();
	Если Не ПустаяСтрока(Квитанция) Тогда
		ТекущийОбъект.Квитанция = Новый ХранилищеЗначения(Квитанция, Новый СжатиеДанных(9));
	КонецЕсли;
	
	ХешСумма = ИнтеграцияМДЛП.ХешСуммаСтрокой(Сообщение);
	ТекущийОбъект.ХешСумма = ХешСумма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТекстСообщения(ТекстовыйДокумент, Сообщение)
	
	Если Сообщение <> Неопределено Тогда
		
		Текст = ИнтеграцияМДЛП.ФорматироватьТекстСообщения(Сообщение);
		ТекстовыйДокумент.УстановитьТекст(Текст);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
